[{
    "id": 0,
    "pageurl": "/",
    "headline": "The Lawyer Dude",
    "nextPage": "/overview",
    "nextPageIDs": [100]
  },
  {
    "id": 1,
    "pageurl": "/learninggoals",
    "headline": "What you learn in this story",
    "panels": [
      "This online learning unit will help you to understand how to use images from the internet.",
      "You will learn about the differences of all rights reserved, some rights reserved and no rights reserved images and what information is mandatory in order to legally use them.",
      "You will also be introduced to different tools and repositories that can help you find free licensed images on the internet.",
      "Find your own path through the game and be rewarded by acquiring a lot of helpful knowledge.",
      "OK, lets learn how to use images from the internet without going to jail!"
    ],
    "nextPage": "/entername",
    "nextPageIDs": [2]
  },
  {
    "id": 2,
    "pageurl": "/entername",
    "headline": "Introduce yourself",
    "panels": [
      "Hello. Are you interested in learning about copyright and free licenses? That’s great, you came to the right place.",
      "But, how rude of me! I totally forgot to introduce myself. I am the Lawyer Dude, your legal advisor and I am here to help you.",
      "Before we start our exciting journey through the beautiful world of licenses, how shall I call you?"
    ],
    "nextPage": "/introduction",
    "nextPageIDs": [3]
  },
  {
    "id": 3,
    "pageurl": "/introduction",
    "headline": "Let's get started",
    "panels": [
      "Hey {username}, nice to meet you.",
      "Don’t worry. I know that there is a lot of confusion about using images from the internet. But it is actually not that complicated. Let’s just do it together, alright?",
      {
        "text": "When using images from the internet, you can’t avoid talking about copyright. Traditional copyright though is a rather restrictive regime which gives copyright holders exclusive rights (as in “all rights reserved” as a default). Neither copying and distributing nor modifying is permitted without an explicit permission. Only a few use cases get special permissions directly from the law. These so called copyright exceptions are reserved for certain users like teachers in public schools, journalists, judges and so on. Everybody else must rely on explicit permissions from the copyright holders. Unfortunately, this makes traditional copyright not quite compatible with the digital age. <br><br> In this way open licensing (or free licensing) is particularly important in a digital context. Open licensing is meant to make granting permissions easier, which in turn makes reusing content like images easier: Open content is “pre-permitted-to-use content”. This enables others to use this content like images and hand it over to others. Thereby it is a way for creators and rights holders to spread their work more easily - by allowing others to use, share and mix their work without needing to ask for (added individual) permission in advance. By the help of open license models, rights holders determine how their work may be used (“some rights reserved” instead of the default “all rights reserved”). More on this later. <br><br> Unless otherwise stated, the “all rights reserved” rule usually applies: As mentioned before, you are not allowed to use others people’s works without asking for permission. Use in this context is anything beyond consumption of the impression which means anything beyond looking at images, listening to music and so on. So if the rights holder did not give you the explicit right to use, publish or modify the image you have no right to do so. You can imagine that this could be difficult for you if you want to use an image online. A quick use of the work is usually not possible this way. <br><br> By contrast, there is the open content licensing model invented by Creative Commons, the so called CC licenses. If someone publishes her or his own work under such a license, this means that only <b>“some rights are reserved”</b>. Through the use of CC licenses, millions of people have made their photos, videos and other creative content globally available for everyone to use. You can use freely licensed images as long as you follow some basic rules that are defined in the license conditions. One condition all CC licenses have in common is <i>attribution</i>. It aims to ensure that right holders to get the credit for their work they deserve. Just like you, the next time you publish your own image! <br><br> In addition, Creative Commons also provides a tool that allows rights holders to waive all rights and place a work in the public domain (<b>“all rights granted”</b>).",
        "type": "resource"
      },
      "Now, that you are on board - what brought you here anyway?"
    ],
    "decisions": [
      "I found a nice image on the internet that I would like to use. Can you show me how to use it correctly?",
      "I am not sure where to look for an image that I can use for my own purpose. Can you help me?"
    ],
    "nextPage": ["/imagesfrominternet", "/searchingonline"],
    "nextPageIDs": [4, 5]
  },
  {
    "id": 4,
    "pageurl": "/imagesfrominternet",
    "headline": "How to use images from the internet",
    "panels": [
      "Of course I can help you. Let me show you how to find out if you are allowed to and how to use an image from the internet.",
      "I believe you now know the very basics of open licensing by now, so let’s take a look at the so called CC licenses.",
      {
        "text": "So now we get into open licensing a little deeper. I would like to introduce you to the CC legal tools. Don’t worry we’ll make it simple and concentrate on the CC licenses that are the most relevant for your context. In the end you will know how you can use a freely licensed image. I promise.",
        "type": "resource"
      },
      {
        "text": "Before we start let’s have a look at a symbol which I'm sure you've met many times before: <br><br> This pictogram shows you that this image is protected by copyright as explained at the very beginning. It is usually used to indicate that the rights holder reserves all rights. Copying, distributing, modifying is not allowed unless you ask for permission to use it (<b>“all rights reserved”</b>).",
        "type": "resource",
        "images": [""]
      },
      {
        "text": "The absolute opposite to this is when rights holders waive all rights and place their works in the public domain. <br><br> This pictogram states that all rights are granted for any use of a work in any way and for any purpose (<b>“all rights granted”</b>). Works in the public domain are free of protection. Either because the term of protection has expired or they were not copyright-protected in the first place. <br> Creative Commons additionally offers a second tool that causes a similar legal status like the public domain tool: CC0. Rights holders are actively waiving all rights from their works. Consequently, all works licensed under CC0 can be used by anyone without any restrictions or obligations (<b>“all rights waived”</b>).",
        "type": "resource",
        "images": ["images/pd.svg", "images/Cc-zero.svg"]
      },
      {
        "text": "Now you already know the public domain tool (or so called “waiver”). Let’s have a look at the CC licenses. <br><br> Each license contains at least one of four basic elements which are illustrated by abbreviations and pictograms. These elements can be combined with each other. Licenses’ names always start with the “CC” abbreviation. Let’s have a look how this might look like: <br><br> BY stands for “attribution” and means you have to mention the author and other parties designated for attribution. The corresponding license is therefore called “CC BY”. It means that you are free to use the work in any way and for any purpose - it therefore is the most permissive type of all CC licences. By the way, every license contains the obligation to name the author (i. e. every CC license contains the “BY” element). <br><br> SA stands for “Share Alike” and means that anyone who modifies the original work must share the adapted version under a CC BY-SA license or a compatible licence. Apart from this, all license conditions of the CC BY license are still valid here. <br><br> ND stands for “No Derivatives” which means that you are not allowed to modify the work in any way. The corresponding license is called “CC BY-ND”. Apart from this, all license conditions of the CC BY license are still valid here. <br><br> NC stands for “Non Commercial” and states - contrary to the previous mentioned licenses - that you are not allowed to use the work commercially. With “CC BY-NC” any reproduction or modification of a workin order to realise a commercial gain is not permitted. Apart from this, all license conditions of the CC BY license are still valid here.",
        "type": "resource",
        "images": ["images/Cc-by.svg", "images/Cc-sa.svg", "images/Cc-nd.svg", "images/Cc-nc.svg"]
      },
      {
        "text": "As if that weren't enough the four elements can be combined. But don’t worry we won’t go any deeper into this. Maybe you can keep in mind a <i>simple rule</i>: <br> The more restrictions a license contains the less it is compatible with the idea of <i>free cultural works</i> or the <i>open definition</i>. To give you one example, let me shortly introduce the most restrictive CC license to you: CC BY-NC-ND. You may not use a work commercially, nor modify it. So, you're probably gonna agree with me that this isn't necessarily making sharing easier.",
        "type": "resource"
      },
      {
        "text": "This infographic may help you to better understand the CC license spectrum between “public domain/most open” (top) and “all rights reserved/least open” (bottom). Hint: Focus on the darker green area and therefore on the public domain tools “PD” and “CC0” as well as the two CC licenses “CC BY” and “CC BY-SA”.",
        "type": "resource",
        "images": ["images/Creative_Commons_Lizenzspektrum_DE.svg"]
      },
      "Are you aware of which of the licenses I just explained applies to your image?"
    ],
    "decisions": [
      "Phhh, that is way too complicated. I will just use the image. No one ever will find out anyways.",
      "To be honest, I don’t know.",
      "Forget about the image! Is there a way to directly access those freely licensed images you just mentioned?"
    ],
    "nextPage": ["/stealingimages", "/understandingsource", "/usingfreelicenses"],
    "nextPageIDs": [300, 6, 7]
  },
  {
    "id": 5,
    "pageurl": "/searchingonline",
    "headline": "How to search for images online",
    "panels": [
      "Alright then. Let’s find a nice image that fits your needs.",
      "I believe you now know the very basics of open licensing by now, so let’s take a look at the so called CC licenses before we continue.",
      {
        "text": "So now we get into open licensing a little deeper. I would like to introduce you to the CC legal tools. Don’t worry we’ll make it simple and concentrate on the CC licenses that are the most relevant for your context. In the end you will know how you can use a freely licensed image. I promise.",
        "type": "resource"
      },
      {
        "text": "Before we start let’s have a look at a symbol which I'm sure you've met many times before: <br><br> This pictogram shows you that this image is protected by copyright as explained at the very beginning. It is usually used to indicate that the rights holder reserves all rights. Copying, distributing, modifying is not allowed unless you ask for permission to use it (<b>“all rights reserved”</b>).",
        "type": "resource",
        "images": [""]
      },
      {
        "text": "The absolute opposite to this is when rights holders waive all rights and place their works in the public domain. <br><br> This pictogram states that all rights are granted for any use of a work in any way and for any purpose (<b>“all rights granted”</b>). Works in the public domain are free of protection. Either because the term of protection has expired or they were not copyright-protected in the first place. <br> Creative Commons additionally offers a second tool that causes a similar legal status like the public domain tool: CC0. Rights holders are actively waiving all rights from their works. Consequently, all works licensed under CC0 can be used by anyone without any restrictions or obligations (<b>“all rights waived”</b>).",
        "type": "resource",
        "images": ["images/pd.svg", "images/Cc-zero.svg"]
      },
      {
        "text": "Now you already know the public domain tool (or so called “waiver”). Let’s have a look at the CC licenses. <br><br> Each license contains at least one of four basic elements which are illustrated by abbreviations and pictograms. These elements can be combined with each other. Licenses’ names always start with the “CC” abbreviation. Let’s have a look how this might look like: <br><br> BY stands for “attribution” and means you have to mention the author and other parties designated for attribution. The corresponding license is therefore called “CC BY”. It means that you are free to use the work in any way and for any purpose - it therefore is the most permissive type of all CC licences. By the way, every license contains the obligation to name the author (i. e. every CC license contains the “BY” element). <br><br> SA stands for “Share Alike” and means that anyone who modifies the original work must share the adapted version under a CC BY-SA license or a compatible licence. Apart from this, all license conditions of the CC BY license are still valid here. <br><br> ND stands for “No Derivatives” which means that you are not allowed to modify the work in any way. The corresponding license is called “CC BY-ND”. Apart from this, all license conditions of the CC BY license are still valid here. <br><br> NC stands for “Non Commercial” and states - contrary to the previous mentioned licenses - that you are not allowed to use the work commercially. With “CC BY-NC” any reproduction or modification of a workin order to realise a commercial gain is not permitted. Apart from this, all license conditions of the CC BY license are still valid here.",
        "type": "resource",
        "images": ["images/Cc-by.svg", "images/Cc-sa.svg", "images/Cc-nd.svg", "images/Cc-nc.svg"]
      },
      {
        "text": "As if that weren't enough the four elements can be combined. But don’t worry we won’t go any deeper into this. Maybe you can keep in mind a <i>simple rule</i>: <br> The more restrictions a license contains the less it is compatible with the idea of <i>free cultural works</i> or the <i>open definition</i>. To give you one example, let me shortly introduce the most restrictive CC license to you: CC BY-NC-ND. You may not use a work commercially, nor modify it. So, you're probably gonna agree with me that this isn't necessarily making sharing easier.",
        "type": "resource"
      },
      {
        "text": "This infographic may help you to better understand the CC license spectrum between “public domain/most open” (top) and “all rights reserved/least open” (bottom). Hint: Focus on the darker green area and therefore on the public domain tools “PD” and “CC0” as well as the two CC licenses “CC BY” and “CC BY-SA”.",
        "type": "resource",
        "images": ["images/Creative_Commons_Lizenzspektrum_DE.svg"]
      },
      "Where do you usually look for images?"
    ],
    "decisions": [
      "Google.",
      "I don’t know. You tell me!"
    ],
    "nextPage": ["/usingsearchengines", "/usingfreelicenses"],
    "nextPageIDs": [18, 7]
  },
  {
    "id": 6,
    "pageurl": "/understandingsource",
    "headline": "Understanding the Source",
    "panels": [
      "No problem. I can help you to find all the information you need in order to use the image. First let’s start with the source of an image.",
      "As I already mentioned before, there are three different ways of licensing images. Many images that can be found online have all rights reserved. Here you need to ask for permission to use the image. Some images have some rights reserved. Those are covered by the CC licenses. And some images are under the public domain, so there are no rights reserved. These images are free to use without any further restrictions.",
      "If you want to use the image, you need to tell others where the image is from and how it is licensed. So first, where did you find your image?"
    ],
    "decisions": [
      "Seriously? I don't remember. Somewhere on the internet.",
      "I’ve saved the source link.",
      "I found it somewhere on Wikimedia Commons or Wikipedia."
    ],
    "nextPage": ["/dontusetheimage", "/findingholder", "usingwiki"],
    "nextPageIDs": [15, 8, 9]
  },
  {
    "id": 7,
    "pageurl": "/usingfreelicenses",
    "headline": "How to use online repositories",
    "panels": [
      "I know, you probably expect me to show you a magical way on how to find images, that you can easily use. Well, there is something just like that.",
      {
        "text": "There are many different image repositories on the internet. Not all of them are free to use in any context. The biggest repository for free licensed images is <b>Wikimedia Commons</b>. So, let’s have look at it first. <br><br> Wikimedia Commons hosts more than 50 million media files such as images, audio and video files that are free to use for all!",
        "type": "resource",
        "images": ["images/wikimedia_commons.png"]
      },
      {
        "text": "You have likely seen images from Wikimedia Commons before as Wikipedia gets its images and other media files from Wikimedia Commons. The great thing about Wikimedia Commons is that all media files are published under a free license or in the public domain. That means that you can use, share or mix them as long as you comply with the license conditions. You can even use them commercially. By now, you have already gotten to know the different CC licenses, so I  hope you are already familiar with them!",
        "type": "resource"
      },
      {
        "text": "There are a lot of other repositories like <a href=\"www.flickr.com\">www.flickr.com</a> or <a href=\"www.pixabay.com\">www.pixabay.com</a> and many others more. If you don't find what you are looking for on Wikimedia Commons you'll definitely find it there. However, the way copyright information are stated is not prescribed by law - so they might differ from author to author and repository to repository. Flickr for example hosts many non-free images. Some repositories even decided to make up their own licenses. Pixabay for example offers images similar to the conditions of images in the public domain but has its own <i>Pixabay license</i>. So always keep that in mind and check copyright information respectively terms of use carefully. ",
        "type": "resource"
      },
      "Now I’ve told you a lot about repositories. What do you think so far?"
    ],
    "decisions": [
      "Wow, I love it. Tell me more about Wikimedia Commons!",
      "I am not convinced yet. Aren’t there more possibilities?"
    ],
    "nextPage": ["/usingwiki", "/usingsearchengines"],
    "nextPageIDs": [9, 18]
  },
  {
    "id": 8,
    "pageurl": "/findingholder",
    "headline": "Who is the creator of the image?",
    "panels": [
      "That’s good! The image’s source is one component of the so called license notice that we will have to create. You should write down or copy the link now, in order to use it for the license notice later.",
      "Another very important thing is to know the copyright holder of the image.",
      "The copyright holder is the creator of the image and the one who decides what other people are allowed or not allowed to do with it.",
      "Are you able to find out the name of the creator of your image?"
    ],
    "decisions": [
      "I don’t care who created the image!",
      "Found it!",
      "No, I cannot find any information on that."
    ],
    "nextPage": ["/stealingimages", "/copyrightinfo", "/dontusetheimage"],
    "nextPageIDs": [300, 10, 15]
  },
  {
    "id": 9,
    "pageurl": "/usingwiki",
    "headline": "How to use Wikimedia Commons",
    "panels": [
      "I'd love to!",
      {
        "text": "Now let me tell you more about Wikimedia Commons. It is a rapidly growing media file repository of common and freely licensed media content – in the form of images, audio and video files – to which anyone can contribute. The collection is compiled, prepared and made available jointly by volunteers and cultural institutions. <br><br> Unlike traditional media repositories, Wikimedia Commons is <i>free</i>. Everyone is allowed to copy, use and modify any files here freely as long as they follow the terms specified by the author; this often means crediting the source and author(s) appropriately and releasing copies/improvements under the same freedom to others. The license conditions of each individual media file can be found on their description page. <br><br> The material in the repository is sorted into categories and presented in galleries – in fact, working with Wikimedia Commons is incredibly simple. Three categories of the media archive are particularly good examples of the outstanding quality of the collection and the high standards of its contributors: “Featured Pictures”, “Quality Images” and “Valued Images”. <br><br> <b>Search and find</b> <br> Here’s how to find files in Wikimedia Commons really quickly: <br><br> From Wikipedia, for example, you can get to the image integrated in an article quickly and simply by clicking on it (or on the file name for audio or video elements). A click on the link “description page there” then takes you to the media database. Another option is a direct keyword search on: commons.wikimedia.org. Or get inspired by clicking through the media archive’s category system! And if you get lost, you can still take the way through CC-Search and look through the results. <br><br> <b>Copyright and use</b> <br> All files on Wikimedia Commons must either be in the public domain or under a free license. Most pictures in Wikimedia Commons are licensed under a <b>CC BY-SA license</b>, that ensures that free licensed images also stay free in the future. <br> In this license the copyright holder of a work has to be named (BY) and the file must be shared on the same terms (SA = share alike), also when it’s edited. <br> To meet the standards of the Wikimedia projects it is important in all cases to indicate the copyright holder and the license on the respective image description page of the medium. <br> <br> If you want, you can easily find great images on Wikimedia Commons. The media files on Wikimedia Commons were shared by thousands of volunteers or even governmental institutions that decided to provide their data to the platform. Right now there are almost 40,000 active users on the platform. It would be great if maybe you would also decide one day to contribute to Wikimedia Commons too to make knowledge even more accessible! <br> <br> <b>General Disclaimer:</b> <br> Please be advised that nothing found in simple online searches has necessarily been reviewed by professionals with the expertise necessary to provide you with complete, accurate or reliable information. <br> <br> That's not to say that you won't find valuable and accurate information at the <i>Wikimedia Commons</i>, however please be advised that <b><i>Wikimedia Commons</i> as a community project cannot guarantee, in any way whatsoever, the validity of the information found here.</b> However, the volunteers are very attentive to copyright rules and have a very close eye on the content of their platform. So it’s not very likely to stumble on images that are actually not usable.",
        "type": "resource"
      },
      "Great, right?"
    ],
    "decisions": [
      "That’s it? So how do I use these images?",
      "Cool, that's very easy. Thank you for showing me where to get images that don’t need an annoying license notice!"
    ],
    "nextPage": ["/usingwiki2", "/stealingimages"],
    "nextPageIDs": [20, 300]
  },
  {
    "id": 10,
    "pageurl": "/copyrightinfo",
    "headline": "Am I allowed to use the image?",
    "panels": [
      "Good. You already found two important components for the license notice. Don’t forget to note down the copyright holder now. You will need it later.",
      "Now it is time to have a look at the copyright information itself.",
      "Did the author provide any information on how the image can be used by others?"
    ],
    "decisions": [
      "No, I was looking for it but couldn’t find any information!",
      "Yes, but I am not sure, what they actually mean.",
      "Yes, it is one of the CC licenses.",
      "It says “all rights reserved”."
    ],
    "nextPage": ["/dontusetheimage", "/dontusetheimage", "/gettinglicense", "/dontusetheimage"],
    "nextPageIDs": [15, 15, 11, 15]
  },
  {
    "id": 11,
    "pageurl": "/gettinglicense",
    "headline": "Understand the license",
    "panels": [
      "Great, that makes life pretty easy.",
      "But although the CC licenses are clearly structured as you’ve already seen, it can be difficult to interpret them properly in a specific use case.",
      "Let’s have a look at some examples together."
    ],
    "decisions": [
      "OK."
    ],
    "nextPage": ["/findthelicense"],
    "nextPageIDs": [27]
  },
  {
    "id": 12,
    "pageurl": "/usinglicense",
    "headline": "Use the image",
    "panels": [
      "Well done. Now you should feel comfortable to apply your knowledge.",
      "Do you feel comfortable to use the image now?"
    ],
    "decisions": [
      "Let me have a look at the examples again.",
      "Sure, let’s do it.",
      "I still don’t understand if I can use the image for my purpose."
    ],
    "nextPage": ["/findthelicense", "/creatingnotice", "/dontusetheimage"],
    "nextPageIDs": [27, 13, 15]
  },
  {
    "id": 13,
    "pageurl": "/creatingnotice",
    "headline": "Create the license notice",
    "panels": [
      "Now that you collected all necessary information it’s time to create the license notice.",
      "A license notice consists of four components: ",
      {
        "text": "A license notice consists of four components: <br><br> <b>Title - What is the name of the image?</b> <br> If a title was provided for the material, include it. Sometimes a title is not provided; in that case, don't worry about it. <br><br> <b>Author - Who owns the image?</b> <br> Name the author or authors of the image in question. Sometimes, the licensor may want you to give credit to some other entity, like a company or pseudonym. In rare cases, the licensor may not want to be attributed at all. In all of these cases, just do what they request. <br><br> <b>Source - Where can I find it?</b> <br> Since you somehow accessed the image, you know where to find it. Provide the source of the image so others can, too. Since we live in the age of the Internet, this is usually a URL or hyperlink where the image resides. <br><br> <b>License - How can I use it?</b> <br> You are obviously using the material for free thanks to the CC license, so make note of it. Don't just say the material is Creative Commons, because that says nothing about how the material can actually be used. Remember that there are six different CC licenses; under which license was the work published? Name and provide a link to it, eg. http://creativecommons.org/licenses/by/4.0/ for CC BY. <br> If the licensor included a license notice with more information, include that as well.",
        "type": "resource"
      },
      "Good. Should we do it?"
    ],
    "decisions": [
      "Yeah, let's go!",
      "Actually, I’m still not sure about it..."
    ],
    "nextPage": ["/usingimage", "/dontusetheimage"],
    "nextPageIDs": [14, 15]
  },
  {
    "id": 14,
    "pageurl": "/usingimage",
    "headline": "Generate the license notice",
    "panels": [
      "Great! Now you have all the information you need to use your image from the internet without going to jail."
    ],
    "decisions": [
      "Not sure, tell me more.",
      "Cool."
    ],
    "disclaimer" : "Please note that missing or incorrect information in the license notice will cause that license conditions are being violated. Only if the rights holder or licensor omits certain information, you don't have to mention it (clearly you can't because you don't know them). Be sure to place the license notice close to the work. A usual proximity for the respective medium (e.g. website, script, presentation) is sufficient. A good rule of thumb is that users can find the license information as intuitively and easily as possible. Please credit the author as he wants to be credited. This can sometimes be different than shown here.",
    "nextPage": ["/success"],
    "nextPageIDs": [16]
  },
  {
    "id": 15,
    "pageurl": "/dontusetheimage",
    "headline": "Don't use the image",
    "panels": [
      "“Well, this is a difficult case. If you're missing certain information about the image or you're unsure whether the information you found is really correct, I advise you not to use the image.",
      "If the image you want to use is not freely licensed, it gets complicated as well. Of course you can ask the creator if you can use their image, but in most cases this requires some research and patience. To be honest, in this case, too, I would advise you to look for another image that is freely licensed. That makes the whole thing much easier!",
      {
        "text": "There are many reasons why you should rather not use images you find in the internet without knowing much about it. <br><br> This is an all or nothing question: Either you have a permission or you don’t. Even if you only infringe some parts of a CC license, the whole license is invalid. With CC licenses Version 4.0 you can “heal” this within 30 days, but until then you still are a copyright infringer. <br><br> <b>Option 1: All rights reserved.</b> <br> If you can find out the author of the image, you can try to contact her/him. If she/he allows you to use it in the context you want, you are lucky. Your agreement with him/her might include the information how she/he wants to be credited. <br><br> Using images publicly without permission is a copyright infringement, as is removal of any copyright information or the unauthorized exhibition, reproduction or alteration of an image. Using an image without permission may result in legal consequences including damages, claims to remove all unauthorized copies and even prison time (in extreme cases). <br><br> <b>Option 2: No information</b> <br> If you cannot find any information on the author, usage is likely not permitted as in “all rights reserved”. To not pay attention to such a lack of information is very likely to lead to a copyright violation. <br> Using images publicly without permission is a copyright infringement, as is removal of any copyright information or the unauthorized exhibition, reproduction or alteration of an image. Using an image without permission will result in legal consequences including damages, claims to remove all unauthorized copies and even prison time (in extreme cases). <br><br> <b>Option 3: Some rights reserved</b> <br> If the content is under a free license (some rights reserved) but you don’t get the license notice right it’s like not having permission at all. <br> Using images publicly without permission is a copyright infringement, as is removal of any copyright information or the unauthorized exhibition, reproduction or alteration of an image. Using an image without permission will result in legal consequences including damages, claims to remove all unauthorized copies and even prison time (in extreme cases).",
        "type": "resource"
      },
      "There are many other ways to find freely licensed images. I can show you some examples of online repositories, which you can use or give you an introduction on how to use a search engine to find those freely licensed images.",
      "What do you want to do next?"
    ],
    "decisions": [
      "Tell me more about those repositories!",
      "If I can not find any legal information how else should I credit it? It’s the creators fault, not mine.",
      "Show me how to use a search engine, please."
    ],
    "nextPage": ["/usingfreelicenses", "/stealingimages", "/usingsearchengines"],
    "nextPageIDs": [7, 300, 18]
  },
  {
    "id": 16,
    "pageurl": "/success",
    "headline": "Success",
    "panels": [
      "Well done! Following the steps you just learned will help you using images the legal way and avoid going to jail.",
      "Actually, there are multiple ways to get here. Would you like to learn more about this topic?"
    ],
    "decisions": [
      "Thanks, that's enough licenses for now!",
      "Tell me more about the use of repositories.",
      "Is there a way to find free images on Google?",
      "What about a specific image I found on a website?"
    ],
    "nextPage": ["/finish", "/usingfreelicenses", "/searchingonline", "/imagesfrominternet"],
    "nextPageIDs": [17, 7, 5, 4]
  },
  {
    "id": 17,
    "pageurl": "/finish",
    "headline": "Finish",
    "panels": [
      "Thank you {username}, it’s been a pleasure to introduce you to the world of licenses and open content.",
      "If you would like to get more information, you are always very welcome to return to this tutorial. Or even start right now by exploring our resources.",
      "Would you like to test yourself on your newly acquired knowledge or just want to have some fun? Go ahead and play all the tutorial games in our “Games” section."
    ],
    "nextPage": ["/overview"],
    "nextPageIDs": [100]
  },
  {
    "id": 18,
    "pageurl": "/usingsearchengines",
    "headline": "How to use search engines",
    "panels": [
      "Google sure is a great place to find images, but there is more. Let me show you.",
      {
        "text": "Surely you often use search engines for your online research. Of course you can also use these for your image search. So let’s have a look together. <br><br> Probably the best known and most frequently used is Google search. However, there are many other search engine providers that you can use for finding images such as Bing, Yahoo! or Ecosia. If you want to limit your search within freely licensed repositories, I recommend you to try out CC Search from Creative Commons. It searches across more than 300 million images from multiple public repositories containing freely licensed or public domain images only.",
        "type": "resource"
      },
      {
        "text": "Let’s go and have look at Google search together. In order to search for images only you need to click on “Images” in the menu bar underneath the search box. Keep in mind that all displayed images are not yet sorted by license - that’s the default setting.",
        "type": "resource",
        "images": ["images/google_search.png"]
      },
      {
        "text": "Now you can further refine your search by only searching for images that are freely licensed or in the public domain. Under “tool” another menu bar pops up. Here you find a selection of “usage rights”. You now see four different “labeled for reuse” options that allow you to search for freely licensed images only.",
        "type": "resource",
        "images": ["images/google_licenses.png"]
      },
      {
        "text": "Google will now show you search results from many different repositories such as Wikimedia Commons, Flickr and others. When you click on an image, the message \",Images may be subject to copyright.\", is usually displayed below the enlarged image. Now you should start looking for more copyright information. All you have to do is click on the image and you will be redirected to the original, in most cases you will be directed to one of the above mentioned repositories. All necessary copyright information should be provided next to the image.",
        "type": "resource"
      },
      {
        "text": "As you see, if you want to look for free licensed pictures in general, the search options do help you a lot. The challenge is, that most of the search engines describe different permissions of use rather than offering a search by any of the CC licences. In general, it's always a good idea to directly check the source in order to find the respective copyright information. <br><br> If you want to skip all of this, the CC Search might be your best friend. You can search by CC licenses and only freely licensed images are displayed which makes it really easy to use!",
        "type": "resource"
      },
      "What do you think about using search engines to find free licensed images now?"
    ],
    "decisions": [
      "I’m not convinced anymore, way too unreliable.",
      "Sounds good to me.",
      "Well, if the search engines already filters the images for me I should be able to just use them without taking further action."
    ],
    "nextPage": ["/usingfreelicenses", "/matchthelicense", "/stealingimages"],
    "nextPageIDs": [7, 22, 300]
  },
  {
    "id": 20,
    "pageurl": "usingwiki2",
    "headline": "Create a license notice",
    "panels": [
      "That depends. You need to create a license notice for most images from the internet if you want to use them. But - surprise - there are a few exceptions.",
      {
        "text": "A license notice consists of four components: <br><br> <b>Title - What is the name of the image?</b> <br> If a title was provided for the material, include it. Sometimes a title is not provided; in that case, don't worry about it. <br><br> <b>Author - Who owns the image?</b> <br> Name the author or authors of the image in question. Sometimes, the licensor may want you to give credit to some other entity, like a company or pseudonym. In rare cases, the licensor may not want to be attributed at all. In all of these cases, just do what they request. <br><br> <b>Source - Where can I find it?</b> <br> Since you somehow accessed the image, you know where to find it. Provide the source of the image so others can, too. Since we live in the age of the Internet, this is usually a URL or hyperlink where the image resides. <br><br> <b>License - How can I use it?</b> <br> You are obviously using the material for free thanks to the CC license, so make note of it. Don't just say the material is Creative Commons, because that says nothing about how the material can actually be used. Remember that there are six different CC licenses; under which license was the work published? Name and provide a link to it, eg. http://creativecommons.org/licenses/by/4.0/ for CC BY. <br> If the licensor included a license notice with more information, include that as well.",
        "type": "resource"
      },
      "But don't worry. There is a tool that will help you."
    ],
    "nextPage": "/attributionGenerator",
    "nextPageIDs": [24]
  },
  {
    "id": 21,
    "pageurl": "/usinggoogle",
    "headline": "Find your image",
    "panels": [
      "Good. Now apply your knowledge to find a nice free licensed image with the help of a search engine of your choice.",
      "Whenever you feel like you found a nice image, we can continue."
    ],
    "decisions": [
      "Let me see those use cases again.",
      "Alright, found one."
    ],
    "nextPage": ["/usingsearchengines", "/collectinfo"],
    "nextPageIDs": [18, 23]
  },
  {
    "id": 22,
    "pageurl": "/matchthelicense",
    "headline": "Match the License",
    "panels": [
      "Unfortunately you can't rely on search engine tools to filter images by CC licenses - that's what I just explained to you. Therefore it is important that you focus on your specific use case if you are looking for an image on the internet. To get a better sense of which licenses are suitable for your use case, you can test it here with a few examples. Select the licenses that are correct for the described use case. It is possible to select multiple licenses."
    ],
    "nextPage": ["/usinggoogle"],
    "nextPageIDs": [21]
  },
  {
    "id": 23,
    "pageurl": "/collectinfo",
    "headline": "Collecting information",
    "panels": [
      "Fine. Now that you found an image, you have to collect the legal information in order to be able to use it.",
      {
        "text": "A license notice consists of four components: <br><br> <b>Title - What is the name of the image?</b> <br> If a title was provided for the material, include it. Sometimes a title is not provided; in that case, don't worry about it. <br><br> <b>Author - Who owns the image?</b> <br> Name the author or authors of the image in question. Sometimes, the licensor may want you to give credit to some other entity, like a company or pseudonym. In rare cases, the licensor may not want to be attributed at all. In all of these cases, just do what they request. <br><br> <b>Source - Where can I find it?</b> <br> Since you somehow accessed the image, you know where to find it. Provide the source of the image so others can, too. Since we live in the age of the Internet, this is usually a URL or hyperlink where the image resides. <br><br> <b>License - How can I use it?</b> <br> You are obviously using the material for free thanks to the CC license, so make note of it. Don't just say the material is Creative Commons, because that says nothing about how the material can actually be used. Remember that there are six different CC licenses; under which license was the work published? Name and provide a link to it, eg. http://creativecommons.org/licenses/by/4.0/ for CC BY. <br> If the licensor included a license notice with more information, include that as well.",
        "type": "resource"
      },
      "Let’s start by checking the image source."
    ],
    "decisions": [
      "OK.",
      "Really? That already sounds like a lot of work to me. Please tell me, that there is an easier way to use the image."
    ],
    "nextPage": ["/understandingsource", "/usingfreelicenses"],
    "nextPageIDs": [6, 7]
  },
  {
    "id": 24,
    "pageurl": "/attributionGenerator",
    "headline": "Attribution Generator",
    "panels": [
      "Wikimedia Commons offers a tool called “Attribution Generator”.",
      "With the “Attribution Generator” Wikimedia Deutschland designed a tool that makes it easy to reuse images from Wikipedia and the free media archive Wikimedia Commons. It helps users to comply with the license conditions and simplify the use of freely licensed images by automatically compiling all relevant license information in to a so-called license notice. Of course, this way of creating license notices can also be adapted for other images not coming from Wikipedia or Wikimedia Commons.",
      "However, a tool can never cover all use cases and characteristics, and thus cannot replace qualified legal advice by a lawyer.",
      "To use the Attribution Generator follow these steps:",
      {
        "text": "<ol> <li>Insert a web address of a Wikimedia Commons image or a Wikipedia article to start the tool</li> <li>Answer the questions about the intended use to create a correct license notice</li> <li>Read how to use the license notice</li> <li>Copy the generated license notice and insert it into your publication to use the image correctly</li> <ol>",
        "type": "resource",
        "images": ["/images/attribution-generator.gif"]
      },
      "Pretty cool, huh? Just try it yourself, you will be amazed how easy it is: <br><br> <a href=\"https://lizenzhinweisgenerator.de/?lang=en\",>lizenzhinweisgenerator.de</a>",
      "Now I've told you the secret how to use images from the internet without going to jail! But let's not keep this knowledge secret any further - share your knowledge about open content so that everyone can participate."
      ],
    "nextPage": "/success",
    "nextPageIDs": [16]
  },
  {
    "id": 27,
    "pageurl": "/findthelicense",
    "headline": "CC Licenses and their Use Cases",
    "panels": [
      "The CC licenses itself are easy to understand but how about it’s usage in real life? In the following you have to decide if the given use cases are legal under the given license. If so, please mark them as correct.",
      { "question": "What is allowed under a <b> CC0 </b>?",
        "correctAnswers": [1,2,3,4,5,6,7,8,9]
      },
      { "question": "What is allowed under a <b>CC-BY</b> license?",
        "correctAnswers": [2,3,4,5,7,8,9]
      },
      { "question": "What is allowed under a <b>CC-BY-SA</b> license?",
        "correctAnswers": [1]
      }     
    ],
    "nextPage": "/usinglicense",
    "nextPageIDs": [12]
  },
  {
    "id": 100,
    "pageurl": "/overview",
    "headline": "Welcome to the Lawyer Dude",
    "tutorial": [
      { "head": "The Lawyer Dude Tutorial",
        "text": "This tutorial will show you how to correctly license images from the Internet and use them for your own purposes. In about 30 minutes you will click through your individual story and learn all the important facts about open content, Creative Commons and license notices."
      }
    ],
    "resources": [
      { "head": "Resources",
        "text": "Here you find all the collected resources about Open Content, Creative Commons, License notices and much more from the world of image licenses. The Lawyer Dude provides you with all the facts and explanations - what are you waiting for?"
      }
    ],
    "games": [
      { "head": "Games",
        "text": "Do you want to improve or just check your knowledge on Open Content, Creative Commons and alike? You've come to the right place. Play all the games featured in the Lawyer Dude Tutorial again and learn in a fun way what to look out for when using images from the Internet."
      }
    ],
    "nextPage": ["/learninggoals", "/resources", "/games"],
    "nextPageIDs": [1, 101, 102]
  },
  {
    "id": 101,
    "pageurl": "/resources",
    "headline": "Resources"
  },
  {
    "id": 102,
    "pageurl": "/games",
    "nextPage": ["/overview","/matchthelicense", "/findthelicense", "/jailgame1", "/jailgame2"],
    "nextPageIDs": [100, 103, 104, 105, 106]
  },
  {
    "id": 103,
    "pageurl": "/matchthelicense",
    "nextPage": ["/games"],
    "nextPageIDs": [102]
  },
  {
    "id": 104,
    "pageurl": "/findthelicense",
    "headline": "CC Licenses and their Use Cases",
    "panels": [
      "The cc licenses itself are easy to understand but how about it’s usage in real life? In this game you have to decide if you are allowed to use an image under the given license in the described use case.",
      "Simply select all use cases that are valid for the given license.",
      { "question": "What is allowed under a <b> CC0 </b>?",
        "correctAnswers": [1,2,3,4,5,6,7,8,9]
      },
      { "question": "What is allowed under a <b>CC-BY</b> license?",
        "correctAnswers": [2,3,4,5,7,8,9]
      },
      { "question": "What is allowed under a <b>CC-BY-SA</b> license?",
        "correctAnswers": [1]
      }     
    ],
    "nextPage": ["/games"],
    "nextPageIDs": [102]
  },
  {
    "id": 105,
    "pageurl": "/jailgame1",
    "headline": "Get out of jail Game",
    "panels": [
      "Enter here the text that is supposed to appear before the game! (just one text if possible)",
      { "question": "Which of the following statements apply to the CC BY-SA license?",
        "correctAnswers": [1,4,5],
        "choices" : [
          { "id": 1,
            "choice": "The content is bound to the original or a compatible license."
          },
          { "id": 2,
            "choice": "Modification of the content is prohibited."
          },
          { "id": 3,
            "choice": "The commercial use of the content is prohibited."
          },
          { "id": 4,
            "choice": "Wikipedia content is published under this license."
          },
          { "id": 5,
            "choice": "The name of the license holder must be stated."
          }
        ]
      },
      { "question": "Which of the following statements apply to the CC-BY license?",
        "correctAnswers": [1],
        "choices" : [
          { "id": 1,
            "choice": "The name of the license holder must be stated."
          },
          { "id": 2,
            "choice": "The content is bound to the original or a compatible license."
          },
          { "id": 3,
            "choice": "Modification of the content is prohibited."
          },
          { "id": 4,
            "choice": "Wikipedia content is published under this license."
          },
          { "id": 5,
            "choice": "The commercial use of the content is prohibited."
          }
        ]
      },
      "Enter here the text after the game (only one panel works!)"
    ],
    "nextPage": ["/games"],
    "nextPageIDs": [102]
  },
  {
    "id": 106,
    "pageurl": "/jailgame2",
    "headline": "Get out of jail Game",
    "panels": [
      "Enter here the text that is supposed to appear before the game!",
      "Enter here another text!"
    ],
    "images" :[
      { "src": "images/Cc-nd.svg", "type": "image", "name": "CC-ND" },
      { "src": "images/Cc-by.svg", "type": "image", "name": "CC-BY" },
      { "src": "images/Cc-sa.svg", "type": "image", "name": "CC-SA" },
      { "src": "images/Cc-nc.svg", "type": "image", "name": "CC-NC" }
    ],
     "solution": [
      { "src": "images/Cc-by.svg", "name": "CC-BY" },
      { "src": "images/Cc-sa.svg", "name": "CC-SA" },
      { "src": "images/Cc-nd.svg", "name": "CC-ND" },
      { "src": "images/Cc-nc.svg", "name": "CC-NC" }
    ],
    "exitTexts": [
      "Enter here the text after the game (only one panel works!)"
    ],
    "nextPage": ["/games"],
    "nextPageIDs": [102]
  },
  {
    "id": 300,
    "pageurl": "/stealingimages",
    "headline": "You are in jail!",
    "panels": [
      "Uh oh. I'm afraid that’s not the way to go. If you want to use an image from the internet you have to follow the rules.",
      "But don’t worry, I am here to help you out.",
      {
        "text": "Well...come to jail! Actually, it's quite simple! Just ask yourself the following questions before you use an image from the Internet: <br> <b>Who is the author of the image?</b> <br> Do not use images from the internet that come without any copyright information. Because if it is not a freely licensed image, you need the permission of the author to use the image. The only exception is that the rules the image was published under do not require attribution at all (see the public domain waiver “CC0”). <br><br> <b>How may I use the image?</b> <br> Remember, there are four different options: <br><br> <ul> <li><i>All rights reserved</i> <br> Copyright prohibits any use of the image without the author’s permission. So rather use another image or contact the author and ask for permission to use it.</li> <li><i>Some rights reserved</i> <br> By the help of open license models like the CC licenses, rights holders determine how their work may be used. You can use freely licensed images without asking for permission as long as you follow the conditions defined in the license. </li><li><i>All rights granted</i> <br> Jackpot! The author of the image waived all rights and placed it in the public domain. You are allowed to use the image without any restrictions or obligations. </li><li><i>No information</i> <br> If you cannot find any copyright information using the image without permission is very certainly not permitted. </li></ul> <br><br> <b>What information do I have to provide if I want to use an image?</b> <br>  This depends on your specific use case. A so-called <b>license notice</b> generally consists of <br> <ul> <li> the <i>title</i> of the image (if there is one), <li>the name of the <i>author</i>,</li><li>the <i>source</i> of the image,</li><li>and the link to the <i>license</i>.</li></ul> <br><br> See, it's actually not that difficult. Just follow these simple rules and we'll never see each other in this place again. In case of doubt simply start a new search and select a freely licensed image that contains all necessary information for a correct license notice.",
        "type": "resource"
      },
      "But before I can get you out you have to master this..."
    ],
    "nextPage": "/",
    "nextPageIDs": [0]
  },
  {
    "id": 777,
    "pageurl": "/imprint"
  },
  {
    "id": 28,
    "pageurl": "/jailgame1",
    "headline": "Get out of jail",
    "panels": [
      { "question": "Which of the following statements apply to the CC BY-SA license?",
        "correctAnswers": [1,4,5],
        "choices" : [
          { "id": 1,
            "choice": "The content is bound to the original or a compatible license."
          },
          { "id": 2,
            "choice": "Modification of the content is prohibited."
          },
          { "id": 3,
            "choice": "The commercial use of the content is prohibited."
          },
          { "id": 4,
            "choice": "Wikipedia content is published under this license."
          },
          { "id": 5,
            "choice": "The name of the license holder must be stated."
          }
        ]
      },
      { "question": "Which of the following statements apply to the CC-BY license?",
        "correctAnswers": [1],
        "choices" : [
          { "id": 1,
            "choice": "The name of the license holder must be stated."
          },
          { "id": 2,
            "choice": "The content is bound to the original or a compatible license."
          },
          { "id": 3,
            "choice": "Modification of the content is prohibited."
          },
          { "id": 4,
            "choice": "Wikipedia content is published under this license."
          },
          { "id": 5,
            "choice": "PLACEHOLDER"
          }
        ]
      }
    ],
    "nextPage": "/placeholder",
    "nextPageIDs": [123]
  }
]